{
    "projectStatus": {
        "0": "Discontinued",
        "1": "Hiatus",
        "2": "Active"
    },
    "projects": [
        {
            "id": "jobheron ",
            "name": "JobHeron ",
            "timeRange": "2022",
            "status": 2,
            "description": "The client needed to improve his website’s performance and responsiveness, and came to me and my team with a request to modernize his web app’s tech stack. He had a detailed vision of the new functionality that had to be developed. The resulting staffing application would boost recruiters’ efficiency by helping them avoid doing the same work over and over again, offering a quick and simple way to get suitable job candidates. Technologies Used: NextJS, Storybook and Mobx",
            "imgUrl": "3.png",
            "url": "https://jobheron.co.uk/",
            "github": "https://github.com/ghostman2311"
        },
        {
            "id": "insideout ",
            "name": "InsideOut ",
            "timeRange": "2021",
            "status": 0,
            "description": "The client noted that their existing web app version of the self monitoring features was better suited to a dedicated mobile app in order to leverage the convenience of a mobile phone during important times such as meals or distressing situations. The client approached me and my team to create a companion app for the web version, converting the existing site while using best practice mobile design to make the app easy to use and engaging. Technologies: React, Apollo and GraphQL",
            "imgUrl": "story.png",
            "url": "https://lettheinsideout.com/",
            "github": "https://github.com/ghostman2311"
        },
        {
            "id": "halalfoodhunt ",
            "name": "Halalfoodhunt ",
            "timeRange": "2021",
            "status": 2,
            "description": "My client turned to us with the need to update, optimize and extend the functionality of an existing food marketplace platform. Refactoring is an important and effective activity to optimize the source code in a well manner. It makes a code easier to understand and improves the quality and app’s architecture. The complexity of this project has been reduced after applying the refactoring and improving the quality of the food service marketplace product. By means of optimization we reduced the maintenance cost because the complexity of software has been decreased, though the core functionality has been significantly extended. Technologies Used: React, React Native and Redux",
            "imgUrl": "halalfoods.png",
            "url": "https://halalfoodhunt.com/",
            "github": "https://github.com/ghostman2311"
        },
        {
            "id": "brioche",
            "name": "Brioche",
            "timeRange": "2020",
            "status": 2,
            "description": "Brioche is a React UI component library based off the reusable components and stylesheets that were developed via my personal website over the years. It is currently under heavy development and may not have all commonly-used UI components.\n\nIt is the successor to Cardo, my previous attempt at building a UI component library.",
            "imgUrl": "",
            "url": "https://www.npmjs.com/package/brioche",
            "github": "https://github.com/ghostman2311/brioche"
        }
    ]
}